redisTestResult/redisMutiThreadsTestResultFix/redis_test_result_by_memtier_benchmark_FM_OFF_2nd/redis_result_Gauss110_FM_OFF_P2_2nd_20230719201218.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        22472.02          ---          ---         4.04467         3.80700         7.80700         9.27900     24688.50 
Gets         2245.98      2245.98         0.00         4.00859         3.79100         7.80700         9.21500      2456.54 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      24718.00      2245.98         0.00         4.04139         3.80700         7.80700         9.27900     27145.04 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.415        0.000
SET       3.295        5.000
SET       3.407       10.000
SET       3.487       15.000
SET       3.551       20.000
SET       3.599       25.000
SET       3.647       30.000
SET       3.695       35.000
SET       3.743       40.000
SET       3.775       45.000
SET       3.807       50.000
SET       3.823       52.500
SET       3.839       55.000
SET       3.871       57.500
SET       3.887       60.000
SET       3.903       62.500
SET       3.919       65.000
SET       3.935       67.500
SET       3.951       70.000
SET       3.967       72.500
SET       3.999       75.000
SET       4.015       76.250
SET       4.015       77.500
SET       4.031       78.750
SET       4.047       80.000
SET       4.063       81.250
SET       4.079       82.500
SET       4.127       83.750
SET       4.127       85.000
SET       4.159       86.250
SET       4.223       87.500
SET       4.255       88.125
SET       4.287       88.750
SET       4.351       89.375
SET       4.415       90.000
SET       4.543       90.625
SET       4.703       91.250
SET       4.959       91.875
SET       5.151       92.500
SET       5.375       93.125
SET       5.567       93.750
SET       5.663       94.062
SET       5.727       94.375
SET       5.823       94.688
SET       5.919       95.000
SET       6.015       95.312
SET       6.143       95.625
SET       6.271       95.938
SET       6.367       96.250
SET       6.559       96.562
SET       6.847       96.875
SET       6.943       97.031
SET       7.039       97.188
SET       7.135       97.344
SET       7.231       97.500
SET       7.295       97.656
SET       7.391       97.812
SET       7.455       97.969
SET       7.519       98.125
SET       7.551       98.281
SET       7.615       98.438
SET       7.647       98.516
SET       7.679       98.594
SET       7.711       98.672
SET       7.743       98.750
SET       7.775       98.828
SET       7.775       98.906
SET       7.807       98.984
SET       7.839       99.062
SET       7.871       99.141
SET       7.903       99.219
SET       7.935       99.258
SET       7.935       99.297
SET       7.967       99.336
SET       7.967       99.375
SET       7.999       99.414
SET       8.031       99.453
SET       8.063       99.492
SET       8.063       99.531
SET       8.095       99.570
SET       8.127       99.609
SET       8.159       99.629
SET       8.191       99.648
SET       8.255       99.668
SET       8.255       99.688
SET       8.255       99.707
SET       8.319       99.727
SET       8.383       99.746
SET       8.447       99.766
SET       8.511       99.785
SET       8.575       99.805
SET       8.639       99.814
SET       8.703       99.824
SET       8.767       99.834
SET       8.831       99.844
SET       8.895       99.854
SET       8.895       99.863
SET       9.023       99.873
SET       9.087       99.883
SET       9.151       99.893
SET       9.279       99.902
SET       9.407       99.907
SET       9.471       99.912
SET       9.535       99.917
SET       9.663       99.922
SET       9.791       99.927
SET       9.855       99.932
SET       9.983       99.937
SET      10.047       99.941
SET      10.111       99.946
SET      10.175       99.951
SET      10.239       99.954
SET      10.303       99.956
SET      10.367       99.958
SET      10.431       99.961
SET      10.495       99.963
SET      10.559       99.966
SET      10.623       99.968
SET      10.687       99.971
SET      10.943       99.973
SET      11.519       99.976
SET      11.967       99.977
SET      12.287       99.978
SET      12.543       99.979
SET      12.735       99.980
SET      12.863       99.982
SET      13.375       99.983
SET      14.015       99.984
SET      14.463       99.985
SET      16.063       99.987
SET      18.047       99.988
SET      18.559       99.988
SET      38.143       99.989
SET      38.399       99.990
SET     651.263       99.990
SET     651.263       99.991
SET     651.263       99.991
SET     651.263       99.992
SET     651.263       99.993
SET     651.263       99.993
SET     651.263       99.994
SET     651.263       99.994
SET     651.263       99.995
SET     651.263       99.995
SET     651.263       99.995
[...]
SET     651.263       99.996
SET     651.263       99.996
SET     651.263       99.996
SET     651.263       99.997
SET     651.263       99.997
SET     651.263       99.997
[...]
SET     651.263       99.998
SET     651.263       99.998
SET     651.263       99.998
[...]
SET     651.263       99.999
SET     651.263       99.999
SET     655.359       99.999
SET     655.359       99.999
SET     655.359       99.999
[...]
SET     655.359      100.000
SET     655.359      100.000
SET     655.359      100.000
[...]
SET     659.455      100.000
SET     659.455      100.000
---
GET       0.599        0.000
GET       3.295        5.000
GET       3.407       10.000
GET       3.471       15.000
GET       3.535       20.000
GET       3.599       25.000
GET       3.647       30.000
GET       3.695       35.000
GET       3.727       40.000
GET       3.759       45.000
GET       3.791       50.000
GET       3.823       52.500
GET       3.839       55.000
GET       3.855       57.500
GET       3.871       60.000
GET       3.887       62.500
GET       3.903       65.000
GET       3.919       67.500
GET       3.935       70.000
GET       3.967       72.500
GET       3.983       75.000
GET       3.999       76.250
GET       4.015       77.500
GET       4.015       78.750
GET       4.031       80.000
GET       4.047       81.250
GET       4.079       82.500
GET       4.095       83.750
GET       4.127       85.000
GET       4.159       86.250
GET       4.191       87.500
GET       4.223       88.125
GET       4.255       88.750
GET       4.287       89.375
GET       4.351       90.000
GET       4.447       90.625
GET       4.543       91.250
GET       4.703       91.875
GET       4.927       92.500
GET       5.183       93.125
GET       5.471       93.750
GET       5.567       94.062
GET       5.631       94.375
GET       5.727       94.688
GET       5.855       95.000
GET       5.951       95.312
GET       6.079       95.625
GET       6.207       95.938
GET       6.303       96.250
GET       6.463       96.562
GET       6.751       96.875
GET       6.879       97.031
GET       6.975       97.188
GET       7.071       97.344
GET       7.167       97.500
GET       7.263       97.656
GET       7.327       97.812
GET       7.391       97.969
GET       7.487       98.125
GET       7.551       98.281
GET       7.583       98.438
GET       7.615       98.516
GET       7.647       98.594
GET       7.679       98.672
GET       7.711       98.750
GET       7.743       98.828
GET       7.775       98.906
GET       7.807       98.984
GET       7.839       99.062
GET       7.871       99.141
GET       7.903       99.219
GET       7.903       99.258
GET       7.903       99.297
GET       7.935       99.336
GET       7.967       99.375
GET       7.967       99.414
GET       7.999       99.453
GET       8.031       99.492
GET       8.063       99.531
GET       8.063       99.570
GET       8.127       99.609
GET       8.127       99.629
GET       8.159       99.648
GET       8.159       99.668
GET       8.191       99.688
GET       8.255       99.707
GET       8.255       99.727
GET       8.319       99.746
GET       8.319       99.766
GET       8.383       99.785
GET       8.511       99.805
GET       8.575       99.814
GET       8.639       99.824
GET       8.703       99.834
GET       8.703       99.844
GET       8.831       99.854
GET       8.895       99.863
GET       8.959       99.873
GET       9.023       99.883
GET       9.087       99.893
GET       9.215       99.902
GET       9.343       99.907
GET       9.343       99.912
GET       9.407       99.917
GET       9.471       99.922
GET       9.535       99.927
GET       9.663       99.932
GET       9.663       99.937
GET       9.727       99.941
GET       9.727       99.946
GET       9.919       99.951
GET       9.983       99.954
GET      10.047       99.956
GET      10.047       99.958
GET      10.047       99.961
GET      10.111       99.963
GET      10.239       99.966
GET      10.303       99.968
GET      10.303       99.971
GET      10.431       99.973
GET      10.687       99.976
GET      10.687       99.977
GET      11.199       99.978
GET      12.287       99.979
GET      12.991       99.980
GET      13.183       99.982
GET      13.951       99.983
GET      13.951       99.984
GET      14.079       99.985
GET      14.399       99.987
GET      14.527       99.988
GET      14.527       99.988
GET      14.527       99.989
GET      14.527       99.990
GET      16.511       99.990
GET      16.511       99.991
GET      37.119       99.991
GET      37.119       99.992
GET     651.263       99.993
GET     651.263       99.993
GET     651.263       99.994
GET     651.263       99.994
GET     651.263       99.995
GET     651.263       99.995
GET     651.263       99.995
[...]
GET     651.263       99.996
GET     651.263       99.996
GET     651.263       99.996
GET     651.263       99.997
GET     651.263       99.997
GET     651.263       99.997
[...]
GET     651.263       99.998
GET     651.263       99.998
GET     651.263       99.998
[...]
GET     651.263       99.999
GET     651.263       99.999
GET     651.263       99.999
[...]
GET     655.359       99.999
GET     655.359      100.000
---
WAIT      0.000      100.000